.emacs.d/vendor/evernote-mode/doc/readme_en.org
#+TITLE:    Emacs evernote mode
#+AUTHOR:   Yusuke Kawakami
#+EMAIL:    Yusuke Kawakami
#+OPTIONS:  email:nil
#+ATTR_HTML: border="2" rules="all" frame="all"

# <<License>>
* QUOTE License

Copyright 2011 Yusuke Kawakami

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

     http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.


# <<Introduction>>
