.emacs.d/vendor/evernote-mode/doc/readme_en.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Emacs evernote mode</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-06-24 06:49:56 JST"/>
<meta name="author" content="Yusuke Kawakami"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>


</head>
<body>
<div id="content">

<h1 class="title">Emacs evernote mode</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1  License </a></li>
<li><a href="#sec-2">2 Introduction </a></li>
<li><a href="#sec-3">3 Evernote note edit mode </a>
<ul>
<li><a href="#sec-3.1">3.1 XHTML mode </a>
<ul>
<li><a href="#sec-3.1.1">3.1.1  An example of XHTML mode editing: </a></li>
</ul>
</li>
<li><a href="#sec-3.2">3.2 TEXT mode </a>
<ul>
<li><a href="#sec-3.2.1">3.2.1  An example of TEXT mode editing: </a></li>
</ul>
</li>
<li><a href="#sec-3.3">3.3 Select edit mode </a></li>
<li><a href="#sec-3.4">3.4 Change edit mode </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Search Query Examples </a></li>
<li><a href="#sec-5">5 Evernote Browser </a></li>
<li><a href="#sec-6">6 Bookmarks </a></li>
<li><a href="#sec-7">7 Install and Settings </a></li>
<li><a href="#sec-8">8 Collaboration with Anything </a></li>
<li><a href="#sec-9">9 Troubleshooting </a>
<ul>
<li><a href="#sec-9.1">9.1 `require': no such file to load &ndash; gdbm </a></li>
<li><a href="#sec-9.2">9.2 `require': no such file to load &ndash; net/https </a></li>
<li><a href="#sec-9.3">9.3 No such file or directory &ndash; enclient.rb (LoadError) </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><a name="License" id="License"></a><span class="section-number-2">1</span>  License </h2>
<div class="outline-text-2" id="text-1">

<pre>
Copyright 2011 Yusuke Kawakami

 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at

     http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.


</pre>

</div>

</div>
