.emacs.d/vendor/evernote-mode/doc/readme_en.org
* Introduction

Emacs evernote mode offers functions to refer and edit Evernote notes directly from Emacs. Currently this package offers the following interfaces.

  - *Command: evernote-login*

    Login to Evernote. The following commands are available only when you login.
    If you execute the following commands without the login, the login prompt will be shown.

  - *Variable: evernote-username*

    An username of your evernote.

  - *Command: evernote-open-note*

    Read an existing note to an Emacs buffer. At first, input tags of the notes, then input the name of the note on the minibuffer.

  - *Command: evernote-open-note-in-notebook*

    Read an existing note to an Emacs buffer. At first, input the notebook and tags of the notes, then input the name of the note on the minibuffer.

  - *Command: evernote-save-note (default bound to \C-x\C-s)*

    Save the modified note..

  - *Command: evernote-create-note*

    Create a note from scratch. The note is created in the default notebook.

  - *Command: evernote-create-note-in-notebook*

    Create a note from scratch. The note is created in the specified notebook.

  - *Command: evernote-write-note*

    Create a new note from the current buffer. The note is created in the default notebook.

  - *Command: evernote-write-note-in-notebook*

    Create a new note from the current buffer. The note is created in the specified notebook.

  - *Command: evernote-post-region*

    Create a new note containing the selected region. The note is created in the default notebook. If you call this command without argument, no buffer associated with the new note is generated, which is different from evernote-open-note and evernote-create-note. If you call this command with an argument by \C-u etc.(not default argument), it creates a new buffer associated with the new note and you can edit the note in the buffer.

  - *Command: evernote-post-region-in-notebook*

    Create a new note containing the selected region. The note is created in the specified notebook.

  - *Command: evernote-change-notebook (default bound to \C-cen)*

    Change the notebook to which the note belongs. The change on Evernote service will be made after exec of evernote-save-note.

  - *Command: evernote-edit-tags (default bound to \C-cet)*

    Change tags attached to the note. The change on Evernote service will be made after exec of evernote-save-note.

  - *Command: evernote-change-edit-mode (default bound to \C-cee)*

    Change the edit mode of the note. (See [[Evernote note edit mode]] for details) The change on Evernote service will be made after exec of evernote-save-note.

  - *Command: evernote-rename-note (default bound to \C-cer)*

    Rename the note. The change on Evernote service will be made after exec of evernote-save-note.

  - *Command: evernote-delete-note (default bound to \C-ced)*

    Delete the note.

  - *Command: evernote-search-notes*

    Search notes by query in the minibuffer. (See [[Search Query Examples]] for details)

  - *Command: evernote-do-saved-search*

    Search notes by using a Saved Search.

  - *Command: evernote-create-notebook*

    Create a new notebook.

  - *Command: evernote-edit-notebook*

    Change the name and whether this book is the default notebook or not.

  - *Command: evernote-create-search*

    Save a query with a name for later use.

  - *Command: evernote-edit-search*

    Change the name and the query of an existing Saved Search.

  - *Command: evernote-toggle-read-only (default bound to \C-x\C-q)*

    Toggle read-only status of the note. When a note of XHTML mode is changed to the read-only status, the command in the variable evernote-enml-formatter-command formats the XHTML. See [[Evernote note edit mode]] for details.

  - *Variable: evernote-enml-formatter-command*

    The command to format XHTML. When a note of XHTML mode is read-only, the command formats the XHTML and displays it. Currently evernote-mode supports w3m as the formatter.

  - *Command: evernote-browser*

    Open Evernote Browser. Evernote Browser offers the features to open notes from the tag hierarchical list, the saved search list and the note list of the past search result. See [[Evernote Browser]] for details.

  - *Variable: anything-c-source-evernote-title*

    The variable that offers the function for Anything(http://www.emacswiki.org/emacs/Anything) to display the note candidates from the title.
    See [[Collaboration with Anything]] for details.

  - *Command: anything-evernote-title*

    Open a note by using Anything. See [[Collaboration with Anything]] for details.

  - *Variable: evernote-mode-display-menu*

    Display the menu on the menubar for evernote-mode (default: t)

  - *Variable: evernote-password-cache*

    Non-nil means that password cache is enabled.
    It is recommended to encrypt the file with EasyPG(http://epg.sourceforge.jp/). EasyPG is included in Emacs 23 or later. On Emacs 22, you install the EasyPG, then add the following line to your .emacs
    @<pre>
    (require 'epa-setup)
    @</pre>
    You can cache the password safely by using gpg-agent.

When you create a note by evernote-create-note, evernote-write-note and evernote-post-region, you can attach tags to the note.
Also, when using the commands, you can input the name and the tag of the note with completion in the minibuffer.


The minor-mode "evernote-mode" is applied to the buffers opening the evernote note. The following commands are available only when "evernote-mode" is valid.

  - evernote-save-note
  - evernote-change-notebook
  - evernote-edit-tags
  - evernote-change-edit-mode
  - evernote-rename-note
  - evernote-delete-note


# <<Evernote note edit mode>>
* Evernote note edit mode

Evernote notes are XML complying with ENML DTD(http://xml.evernote.com/pub/enml2.dtd). evernote-mode offers the two edit mode, XHTML mode and TEXT mode for saving and reading the Evenote notes.


** XHTML mode

When you save the Evernote note in XHTML mode, the content of the buffer will be saved as the content of the note. Therefore if the contents of the buffer is not valid ENML, you cannot save the contents because of the error.

And when you read a Evernote note by using XHTML mode, the buffer is read-only as the initial state. If the variable evernote-enml-formatter-command is set, the content of the buffer is formatted. (See [[Install and Settings]] for details of setting evernote-enml-formatter-command) If you toggle the read-only status and change it to read-write, unformatted XHTML is displayed in the buffer. The buffer will display the formatted text if you change the state to read-only again.


