.emacs.d/vendor/evernote-mode/doc/readme_en.html

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><a name="Introduction" id="Introduction"></a><span class="section-number-2">2</span> Introduction </h2>
<div class="outline-text-2" id="text-2">


<p>
Emacs evernote mode offers functions to refer and edit Evernote notes directly from Emacs. Currently this package offers the following interfaces.
</p>
<ul>
<li>
<b>Command: evernote-login</b>

<p>
Login to Evernote. The following commands are available only when you login.
If you execute the following commands without the login, the login prompt will be shown.
</p>
</li>
<li>
<b>Variable: evernote-username</b>

<p>
An username of your evernote.
</p>
</li>
<li>
<b>Command: evernote-open-note</b>

<p>
Read an existing note to an Emacs buffer. At first, input tags of the notes, then input the name of the note on the minibuffer.
</p>
</li>
<li>
<b>Command: evernote-open-note-in-notebook</b>

<p>
Read an existing note to an Emacs buffer. At first, input the notebook and tags of the notes, then input the name of the note on the minibuffer.
</p>
</li>
<li>
<b>Command: evernote-save-note (default bound to \C-x\C-s)</b>

<p>
Save the modified note..
</p>
</li>
<li>
<b>Command: evernote-create-note</b>

<p>
Create a note from scratch. The note is created in the default notebook.
</p>
</li>
<li>
<b>Command: evernote-create-note-in-notebook</b>

<p>
Create a note from scratch. The note is created in the specified notebook.
</p>
</li>
<li>
<b>Command: evernote-write-note</b>

<p>
Create a new note from the current buffer. The note is created in the default notebook.
</p>
</li>
<li>
<b>Command: evernote-write-note-in-notebook</b>

<p>
Create a new note from the current buffer. The note is created in the specified notebook.
</p>
</li>
<li>
<b>Command: evernote-post-region</b>

<p>
Create a new note containing the selected region. The note is created in the default notebook. If you call this command without argument, no buffer associated with the new note is generated, which is different from evernote-open-note and evernote-create-note. If you call this command with an argument by \C-u etc.(not default argument), it creates a new buffer associated with the new note and you can edit the note in the buffer.
</p>
</li>
<li>
<b>Command: evernote-post-region-in-notebook</b>

<p>
Create a new note containing the selected region. The note is created in the specified notebook.
</p>
</li>
<li>
<b>Command: evernote-change-notebook (default bound to \C-cen)</b>

<p>
Change the notebook to which the note belongs. The change on Evernote service will be made after exec of evernote-save-note.
</p>
</li>
<li>
<b>Command: evernote-edit-tags (default bound to \C-cet)</b>

<p>
Change tags attached to the note. The change on Evernote service will be made after exec of evernote-save-note.
</p>
</li>
<li>
<b>Command: evernote-change-edit-mode (default bound to \C-cee)</b>

<p>
Change the edit mode of the note. (See <a href="#sec-3">Evernote note edit mode</a> for details) The change on Evernote service will be made after exec of evernote-save-note.
</p>
</li>
<li>
<b>Command: evernote-rename-note (default bound to \C-cer)</b>

<p>
Rename the note. The change on Evernote service will be made after exec of evernote-save-note.
</p>
</li>
<li>
<b>Command: evernote-delete-note (default bound to \C-ced)</b>

<p>
Delete the note.
</p>
</li>
<li>
<b>Command: evernote-search-notes</b>

<p>
Search notes by query in the minibuffer. (See <a href="#sec-4">Search Query Examples</a> for details)
</p>
</li>
<li>
<b>Command: evernote-do-saved-search</b>

<p>
Search notes by using a Saved Search.
</p>
</li>
<li>
<b>Command: evernote-create-notebook</b>

<p>
Create a new notebook.
</p>
</li>
<li>
<b>Command: evernote-edit-notebook</b>

<p>
Change the name and whether this book is the default notebook or not.
</p>
</li>
<li>
<b>Command: evernote-create-search</b>

<p>
Save a query with a name for later use.
</p>
</li>
<li>
<b>Command: evernote-edit-search</b>

<p>
Change the name and the query of an existing Saved Search.
</p>
</li>
<li>
<b>Command: evernote-toggle-read-only (default bound to \C-x\C-q)</b>

<p>
Toggle read-only status of the note. When a note of XHTML mode is changed to the read-only status, the command in the variable evernote-enml-formatter-command formats the XHTML. See <a href="#sec-3">Evernote note edit mode</a> for details.
</p>
</li>
<li>
<b>Variable: evernote-enml-formatter-command</b>

<p>
The command to format XHTML. When a note of XHTML mode is read-only, the command formats the XHTML and displays it. Currently evernote-mode supports w3m as the formatter.
</p>
</li>
<li>
<b>Command: evernote-browser</b>

<p>
Open Evernote Browser. Evernote Browser offers the features to open notes from the tag hierarchical list, the saved search list and the note list of the past search result. See <a href="#sec-5">Evernote Browser</a> for details.
</p>
</li>
<li>
<b>Variable: anything-c-source-evernote-title</b>

<p>
The variable that offers the function for Anything(<a href="http://www.emacswiki.org/emacs/Anything">http://www.emacswiki.org/emacs/Anything</a>) to display the note candidates from the title.
See <a href="#sec-8">Collaboration with Anything</a> for details.
</p>
</li>
<li>
<b>Command: anything-evernote-title</b>

<p>
Open a note by using Anything. See <a href="#sec-8">Collaboration with Anything</a> for details.
</p>
</li>
<li>
<b>Variable: evernote-mode-display-menu</b>

<p>
Display the menu on the menubar for evernote-mode (default: t)
</p>
</li>
<li>
<b>Variable: evernote-password-cache</b>

<p>
Non-nil means that password cache is enabled.
It is recommended to encrypt the file with EasyPG(<a href="http://epg.sourceforge.jp/">http://epg.sourceforge.jp/</a>). EasyPG is included in Emacs 23 or later. On Emacs 22, you install the EasyPG, then add the following line to your .emacs
<pre>
(require 'epa-setup)
</pre>
You can cache the password safely by using gpg-agent.
</p>
</li>
</ul>

<p>When you create a note by evernote-create-note, evernote-write-note and evernote-post-region, you can attach tags to the note.
Also, when using the commands, you can input the name and the tag of the note with completion in the minibuffer.
</p>

<p>
The minor-mode "evernote-mode" is applied to the buffers opening the evernote note. The following commands are available only when "evernote-mode" is valid.
</p>
<ul>
<li>
evernote-save-note
</li>
<li>
evernote-change-notebook
</li>
<li>
evernote-edit-tags
</li>
<li>
evernote-change-edit-mode
</li>
<li>
evernote-rename-note
</li>
<li>
evernote-delete-note


</li>
</ul>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><a name="Evernote==note==edit==mode" id="Evernote==note==edit==mode"></a><span class="section-number-2">3</span> Evernote note edit mode </h2>
<div class="outline-text-2" id="text-3">


<p>
Evernote notes are XML complying with ENML DTD(<a href="http://xml.evernote.com/pub/enml2.dtd">http://xml.evernote.com/pub/enml2.dtd</a>). evernote-mode offers the two edit mode, XHTML mode and TEXT mode for saving and reading the Evenote notes.
</p>


</div>

<div id="outline-container-3.1" class="outline-3">
<h3 id="sec-3.1"><span class="section-number-3">3.1</span> XHTML mode </h3>
<div class="outline-text-3" id="text-3.1">


<p>
When you save the Evernote note in XHTML mode, the content of the buffer will be saved as the content of the note. Therefore if the contents of the buffer is not valid ENML, you cannot save the contents because of the error.
</p>
<p>
And when you read a Evernote note by using XHTML mode, the buffer is read-only as the initial state. If the variable evernote-enml-formatter-command is set, the content of the buffer is formatted. (See <a href="#sec-7">Install and Settings</a> for details of setting evernote-enml-formatter-command) If you toggle the read-only status and change it to read-write, unformatted XHTML is displayed in the buffer. The buffer will display the formatted text if you change the state to read-only again.
</p>


</div>
