.emacs.d/vendor/evernote-mode/doc/readme_en.html

<div id="outline-container-3.1.1" class="outline-4">
<h4 id="sec-3.1.1"><span class="section-number-4">3.1.1</span>  An example of XHTML mode editing: </h4>
<div class="outline-text-4" id="text-3.1.1">

<pre>
   Emacs Buffer
   -----------------------------------
   &lt;?xml version="1.0" encoding="UTF-8"?&gt;
   &lt;!DOCTYPE en-note SYSTEM "http://xml.evernote.com/pub/enml2.dtd"&gt;
   &lt;en-note&gt;Evernote notes are XML complying with ENML DTD&lt;br clear="none"/&gt;
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for&lt;br clear="none"/&gt;
   saving and reading the Evenote notes.&lt;br clear="none"/&gt;
   &lt;/en-note&gt;
   -----------------------------------
   | save on XHTML mode
   V
   The content of the note (same as the emacs buffer)
   -----------------------------------
   &lt;?xml version="1.0" encoding="UTF-8"?&gt;
   &lt;!DOCTYPE en-note SYSTEM "http://xml.evernote.com/pub/enml2.dtd"&gt;
   &lt;en-note&gt;Evernote notes are XML complying with ENML DTD&lt;br clear="none"/&gt;
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for&lt;br clear="none"/&gt;
   saving and reading the Evenote notes.&lt;br clear="none"/&gt;
   &lt;/en-note&gt;
   -----------------------------------
   | read on XHTML mode
   V
   Emacs Buffer (read-only and formatted)
   -----------------------------------
   Evernote notes are XML complying with ENML DTD
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for
   saving and reading the Evenote notes.
   -----------------------------------
   |toggle read-only(evernote-toggle-read-only: \C-x\C-q)
   V
   Emacs Buffer (unformatted)
   -----------------------------------
   &lt;?xml version="1.0" encoding="UTF-8"?&gt;
   &lt;!DOCTYPE en-note SYSTEM "http://xml.evernote.com/pub/enml2.dtd"&gt;
   &lt;en-note&gt;Evernote notes are XML complying with ENML DTD&lt;br clear="none"/&gt;
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for&lt;br clear="none"/&gt;
   saving and reading the Evenote notes.&lt;br clear="none"/&gt;
   &lt;/en-note&gt;
   -----------------------------------


</pre>

</div>
</div>

</div>

<div id="outline-container-3.2" class="outline-3">
<h3 id="sec-3.2"><span class="section-number-3">3.2</span> TEXT mode </h3>
<div class="outline-text-3" id="text-3.2">


<p>
In XHTML mode, you have to edit a XHTML as a text but it is a complicated work. evernote-mode offers TEXT mode to make editing text notes easy and effective.
</p>
<p>
The text mode is specialized in editing Evernote notes that only contain text content. When you save an Evernote note, special characters(&amp;keyword; space, newline) in the buffer are escaped and the root element is added to transform it into a XML document. Therefore text contents in the Emacs buffer is same as the appearance of the note. (is not same as the actual XML content of the note.) And when you read a Evernote note by using TEXT mode, evernote-mode reads the contents under the root element of the XML as a text and all the special characters are unescaped then evernote-mode insert it to the buffer.
</p>


</div>

<div id="outline-container-3.2.1" class="outline-4">
<h4 id="sec-3.2.1"><span class="section-number-4">3.2.1</span>  An example of TEXT mode editing: </h4>
<div class="outline-text-4" id="text-3.2.1">

<pre>
Emacs Buffer
   -----------------------------------
   Evernote notes are XML complying with ENML DTD
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for
   saving and reading the Evenote notes.
   -----------------------------------
   | save on TEXT mode
   V
   The content of the note (escaped and transformed into a XML)
   -----------------------------------
   &lt;?xml version="1.0" encoding="UTF-8"?&gt;
   &lt;!DOCTYPE en-note SYSTEM "http://xml.evernote.com/pub/enml2.dtd"&gt;
   &lt;en-note&gt;Evernote notes are XML complying with ENML DTD&lt;br clear="none"/&gt;
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for&lt;br clear="none"/&gt;
   saving and reading the Evenote notes.&lt;br clear="none"/&gt;
   &lt;/en-note&gt;
   -----------------------------------
   | read on TEXT mode
   V
   Emacs Buffer (unescaped and transformed int a text)
   -----------------------------------
   Evernote notes are XML complying with ENML DTD
   evernote-mode offers the two edit mode, XHTML mode and TEXT mode for
   saving and reading the Evenote notes.
   -----------------------------------

</pre>

</div>
</div>

</div>

<div id="outline-container-3.3" class="outline-3">
<h3 id="sec-3.3"><span class="section-number-3">3.3</span> Select edit mode </h3>
<div class="outline-text-3" id="text-3.3">


<p>
You can select the edit mode when you create a note. The edit mode is recorded in the note when you save it, and the recorded edit mode is applied to the note when you reopen it.
</p>

</div>

</div>

<div id="outline-container-3.4" class="outline-3">
<h3 id="sec-3.4"><span class="section-number-3">3.4</span> Change edit mode </h3>
<div class="outline-text-3" id="text-3.4">


<p>
Use the command evernote-change-edit-mode to change the edit mode of the existing note. If you change the edit mode from XHTML mode to TEXT mode and the buffer is read-only, then the content of the TEXT mode is the formatted text. Note that the change will remove all format information(xml tags). If the buffer is read-write, the content of the TEXT mode is the original unformatted text.
</p>

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><a name="Search==Query==Examples" id="Search==Query==Examples"></a><span class="section-number-2">4</span> Search Query Examples </h2>
<div class="outline-text-2" id="text-4">


<p>
Here are examples of queries used for searching notes.
</p>
<p>
The following examples are referred from (<a href="http://www.evernote.com/about/developer/api/evernote-api.htm#_Toc277181479">http://www.evernote.com/about/developer/api/evernote-api.htm#_Toc277181479</a>).
</p>
<ul>
<li>
Find notes containing the word "chicken", tagged with "cooking", and created this year:

</li>
</ul>

<p>chicken tag:cooking created:year
</p>
<ul>
<li>
Find notes tagged with "cooking" but not "mexican" that include the word "beef" but not the word "carrots"

</li>
</ul>

<p>tag:cooking -tag:mexican beef -carrots
</p>
<ul>
<li>
Find notes in my "Travel" notebook with San Francisco in the title:

</li>
</ul>

<p>notebook:Travel intitle:"San Francisco"
</p>
<ul>
<li>
Find notes that either include the text "San Francisco" or are tagged with the "SFO" tag:

</li>
</ul>

<p>any: "San Francisco" tag:SFO
</p>

</div>

</div>
