.emacs.d/vendor/evernote-mode/doc/readme_en.org
* Evernote Browser

Evernote Browser offers the features to open notes from the tag hierarchical list, the saved search list, and the note list of the past search result. These lists are different from the completion lists of evernote-open-note command or the evernote-search-notes command. These lists of Evernote Browser are always kept in Emacs buffers until they are deleted by the user after they were created, and they make the procedure to open notes easy by using these list repeatedly.

Evernote Browser is composed of multiple Evernote Browser pages(emacs buffers). An Evernote Browser page is created when searching notes or when executing the evernote-browser command at the state that no search has been executed. The multiple pages are managed as the page list. There is one valid current page and each page has the next/previous page. Execute the evernote-browser command to move the cursor to the current Evernote Browser page. Also, use the keys for moving to the next/previous page key (described later) to move to another page.

There are three type of Evernote Browser page

    * tag list page
    * saved search list page
    * note list page
    * notebook list page

A tag list page shows the hierarchical tag list created on Evernote service. Pressing Enter(\C-m) on the tag name opens a note list page of the tag.

A saved search list shows the search list created on Evernote service. Pressing Enter(\C-m) on the search name opens a note list page from the search result.

A note list shows the note list from a note search result. The note list page is newly created by the evenote-open-note command, the evernote-search-notes command and by searches on Evernote Browser. Pressing Enter(\C-m) on the note name opens a note.

A notebook list page shows the notebook list created on Evernote service. Pressing Enter(\C-m) on the notebook name opens a note list page associated with the notebook.

The followings are other key assignments on Evernote Browser pages
|-----+--------------------------------------------------------------------------------------------------------------|
| Key | Action                                                                                                       |
|-----+--------------------------------------------------------------------------------------------------------------|
| b   | move to the previous page                                                                                    |
| f   | move to the next page                                                                                        |
| t   | create a tag list page and show it. If a tag list page already exists, move the cursor to the page           |
| S   | create a search list page and show it. If a tag list page already exists, move the cursor to the page        |
| s   | create a note list from the search query input and show it                                                   |
| N   | create a notebook list page and show it. If a notebook list page already exists, move the cursor to the page |
| o   | same as Enter(\C-m), but it does not move the cursor to the opened note                                      |
| n   | move to the next line and open the note on the cursor if in the note list,                                   |
| p   | move to the previous line and open the note on the cursor if in the note list,                               |
| d   | delete the current from Evernote Browser                                                                     |
|-----+--------------------------------------------------------------------------------------------------------------|


# <<Bookmarks>>
* Bookmarks

On Emacs 23.1 or later, you can set emacs bookmarks to the evernote notes.
You can open immediately the note that you can refer frequently by using this feature.

You can use the bookmarks in the same way as when using bookmarks to regular files.
You can set a bookmark to a evernote note by executing 'bookmark-set' (C-x r m RET) in the buffer opening the evernote note.
Also, you can refer the bookmarks 'bookmark-jump' (C-x r b bookmark RET) or 'list-bookmark' (C-x r l).

# <<Install and Settings>>
* Install and Settings

  1. Install ruby scripts for using Evernote service.

    @<pre>
    cd evernote-mode/ruby
    ruby setup.rb
    @</pre>

  2. Copy evernote-mode.el to your load path.

    @<pre>
    cp evernote-mode.el <your load path>
    @</pre>

  3. Get w3m for evernote-enml-formatter-command (Optional)

     - If you use Linux/Unix, get w3m from [[http://w3m.sourceforge.net/index.en.html][here]] and install it or install w3m from the package of your distribution.
     - If you use Win, get cygwin from [[http://www.cygwin.com/][here]], execute setup.exe and select w3m from the "Select Packages"
     - Add the path of w3m to the environment variable "PATH".

  4. Add the evernote-mode configuration to .emacs.

     @<pre>
     (add-to-list 'load-path "<your load path>")
     (require 'evernote-mode)
     (setq evernote-username "<your evernote user name>") ; optional: you can use this username as default.
     (setq evernote-enml-formatter-command '("w3m" "-dump" "-I" "UTF8" "-O" "UTF8")) ; option
     (global-set-key "\C-cec" 'evernote-create-note)
     (global-set-key "\C-ceo" 'evernote-open-note)
     (global-set-key "\C-ces" 'evernote-search-notes)
     (global-set-key "\C-ceS" 'evernote-do-saved-search)
     (global-set-key "\C-cew" 'evernote-write-note)
     (global-set-key "\C-cep" 'evernote-post-region)
     (global-set-key "\C-ceb" 'evernote-browser)
     @</pre>

     If you don't set evernote-enml-formatter-command, the unformatted XHTML is displayed when reading the note of XHTML mode.

		 If you use cygwin for ruby, cygwin-mount.el (http://www.emacswiki.org/cgi-bin/wiki/cygwin-mount.el) is also needed.  Get cygwin-mount.el and put it in your load path, and add the followings lines to your .emacs.

     @<pre>
		 (require 'cygwin-mount)
		 (cygwin-mount-activate)
     @</pre>

  5. Proxy settings

     If you want to use the proxy, set the value to the environment variable 'EN\_PROXY' written as 'host:port' format. (ex. export EN\_PROXY=proxy.hoge.com:8080)


# <<Collaboration with Anything>>
* Collaboration with Anything

evernote-mode offers the function for Anything(http://www.emacswiki.org/emacs/Anything) to display the note candidates from the title.
You can add the evernote note titles to the source of candidates of Anything by adding the following configuration to your .emacs.

@<pre>
(add-to-list 'anything-sources anything-c-source-evernote-title)
@</pre>

You can also use 'anything-evernote-title' to choose the candidates only from the evernote notes.
The above features for Anything are available only when you login the evernote service
(after executing evernote-login or the first time you use the command evernote-xxx).

# <<Troubleshooting>>
* Troubleshooting

