.emacs.d/vendor/evernote-mode/doc/readme_en.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><a name="Evernote==Browser" id="Evernote==Browser"></a><span class="section-number-2">5</span> Evernote Browser </h2>
<div class="outline-text-2" id="text-5">


<p>
Evernote Browser offers the features to open notes from the tag hierarchical list, the saved search list, and the note list of the past search result. These lists are different from the completion lists of evernote-open-note command or the evernote-search-notes command. These lists of Evernote Browser are always kept in Emacs buffers until they are deleted by the user after they were created, and they make the procedure to open notes easy by using these list repeatedly.
</p>
<p>
Evernote Browser is composed of multiple Evernote Browser pages(emacs buffers). An Evernote Browser page is created when searching notes or when executing the evernote-browser command at the state that no search has been executed. The multiple pages are managed as the page list. There is one valid current page and each page has the next/previous page. Execute the evernote-browser command to move the cursor to the current Evernote Browser page. Also, use the keys for moving to the next/previous page key (described later) to move to another page.
</p>
<p>
There are three type of Evernote Browser page
</p>
<ul>
<li>
tag list page
</li>
<li>
saved search list page
</li>
<li>
note list page
</li>
<li>
notebook list page

</li>
</ul>

<p>A tag list page shows the hierarchical tag list created on Evernote service. Pressing Enter(\C-m) on the tag name opens a note list page of the tag.
</p>
<p>
A saved search list shows the search list created on Evernote service. Pressing Enter(\C-m) on the search name opens a note list page from the search result.
</p>
<p>
A note list shows the note list from a note search result. The note list page is newly created by the evenote-open-note command, the evernote-search-notes command and by searches on Evernote Browser. Pressing Enter(\C-m) on the note name opens a note.
</p>
<p>
A notebook list page shows the notebook list created on Evernote service. Pressing Enter(\C-m) on the notebook name opens a note list page associated with the notebook.
</p>
<p>
The followings are other key assignments on Evernote Browser pages
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col align="left" /><col align="left" />
</colgroup>
<thead>
<tr><th scope="col">Key</th><th scope="col">Action</th></tr>
</thead>
<tbody>
<tr><td>b</td><td>move to the previous page</td></tr>
<tr><td>f</td><td>move to the next page</td></tr>
<tr><td>t</td><td>create a tag list page and show it. If a tag list page already exists, move the cursor to the page</td></tr>
<tr><td>S</td><td>create a search list page and show it. If a tag list page already exists, move the cursor to the page</td></tr>
<tr><td>s</td><td>create a note list from the search query input and show it</td></tr>
<tr><td>N</td><td>create a notebook list page and show it. If a notebook list page already exists, move the cursor to the page</td></tr>
<tr><td>o</td><td>same as Enter(\C-m), but it does not move the cursor to the opened note</td></tr>
<tr><td>n</td><td>move to the next line and open the note on the cursor if in the note list,</td></tr>
<tr><td>p</td><td>move to the previous line and open the note on the cursor if in the note list,</td></tr>
<tr><td>d</td><td>delete the current from Evernote Browser</td></tr>
</tbody>
</table>



</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><a name="Bookmarks" id="Bookmarks"></a><span class="section-number-2">6</span> Bookmarks </h2>
<div class="outline-text-2" id="text-6">


<p>
On Emacs 23.1 or later, you can set emacs bookmarks to the evernote notes.
You can open immediately the note that you can refer frequently by using this feature.
</p>
<p>
You can use the bookmarks in the same way as when using bookmarks to regular files.
You can set a bookmark to a evernote note by executing 'bookmark-set' (C-x r m RET) in the buffer opening the evernote note.
Also, you can refer the bookmarks 'bookmark-jump' (C-x r b bookmark RET) or 'list-bookmark' (C-x r l).
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><a name="Install==and==Settings" id="Install==and==Settings"></a><span class="section-number-2">7</span> Install and Settings </h2>
<div class="outline-text-2" id="text-7">


<ol>
<li>
Install ruby scripts for using Evernote service.

<p>
<pre>
cd evernote-mode/ruby
ruby setup.rb
</pre>
</p>
</li>
<li>
Copy evernote-mode.el to your load path.

<p>
<pre>
cp evernote-mode.el &lt;your load path&gt;
</pre>
</p>
</li>
<li>
Get w3m for evernote-enml-formatter-command (Optional)

<ul>
<li>
If you use Linux/Unix, get w3m from <a href="http://w3m.sourceforge.net/index.en.html">here</a> and install it or install w3m from the package of your distribution.
</li>
<li>
If you use Win, get cygwin from <a href="http://www.cygwin.com/">here</a>, execute setup.exe and select w3m from the "Select Packages"
</li>
<li>
Add the path of w3m to the environment variable "PATH".

</li>
</ul>
</li>
<li>
Add the evernote-mode configuration to .emacs.

<p>
<pre>
(add-to-list 'load-path "&lt;your load path&gt;")
(require 'evernote-mode)
(setq evernote-username "&lt;your evernote user name&gt;") ; optional: you can use this username as default.
(setq evernote-enml-formatter-command '("w3m" "-dump" "-I" "UTF8" "-O" "UTF8")) ; option
(global-set-key "\C-cec" 'evernote-create-note)
(global-set-key "\C-ceo" 'evernote-open-note)
(global-set-key "\C-ces" 'evernote-search-notes)
(global-set-key "\C-ceS" 'evernote-do-saved-search)
(global-set-key "\C-cew" 'evernote-write-note)
(global-set-key "\C-cep" 'evernote-post-region)
(global-set-key "\C-ceb" 'evernote-browser)
</pre>
</p>
<p>
If you don't set evernote-enml-formatter-command, the unformatted XHTML is displayed when reading the note of XHTML mode.
</p>
<p>
If you use cygwin for ruby, cygwin-mount.el (<a href="http://www.emacswiki.org/cgi-bin/wiki/cygwin-mount.el">http://www.emacswiki.org/cgi-bin/wiki/cygwin-mount.el</a>) is also needed.  Get cygwin-mount.el and put it in your load path, and add the followings lines to your .emacs.
</p>
<p>
<pre>
(require 'cygwin-mount)
(cygwin-mount-activate)
</pre>
</p>
</li>
<li>
Proxy settings

<p>
If you want to use the proxy, set the value to the environment variable 'EN_PROXY' written as 'host:port' format. (ex. export EN_PROXY=proxy.hoge.com:8080)
</p>

</li>
</ol>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><a name="Collaboration==with==Anything" id="Collaboration==with==Anything"></a><span class="section-number-2">8</span> Collaboration with Anything </h2>
<div class="outline-text-2" id="text-8">


<p>
evernote-mode offers the function for Anything(<a href="http://www.emacswiki.org/emacs/Anything">http://www.emacswiki.org/emacs/Anything</a>) to display the note candidates from the title.
You can add the evernote note titles to the source of candidates of Anything by adding the following configuration to your .emacs.
</p>
<p>
<pre>
(add-to-list 'anything-sources anything-c-source-evernote-title)
</pre>
</p>
<p>
You can also use 'anything-evernote-title' to choose the candidates only from the evernote notes.
The above features for Anything are available only when you login the evernote service
(after executing evernote-login or the first time you use the command evernote-xxx).
</p>
</div>

</div>
