.emacs.d/vendor/evernote-mode/doc/readme_en.org
** `require': no such file to load -- gdbm

Some distributions do not have the GDBM library for ruby. Install libgdbm-ruby for using GDBM.

- ex. for apt,

@<pre>
apt-get install libgdbm-ruby
@</pre>

- In the case of ActiveScriptRuby or Ruby-mswin32

Retrieve gdbm.dll from [[http://jarp.does.notwork.org/win32/][Porting Libraries to Win32]], then copy it to the folder where ruby.exe exists.

- In the case of Mac OS X

The pre-installed ruby on Mac OS X does not contain GDBM bindings.
Re-install ruby and GDBM by [[http://www.macports.org/][MacPorts]] or [[http://mxcl.github.com/homebrew/][Homebrew]].

MacPorts:
@<pre>
$ sudo ports install ruby gdbm
@</pre>

Homebrew:
@<pre>
$ sudo brew install ruby gdbm
@</pre>

Also, [[No%20such%20file%20or%20directory][specify evernote-ruby-command]].

** `require': no such file to load -- net/https

Some distributions do not have the openssl library for ruby. Install libopenssl-ruby for using https.

- ex. for apt,

@<pre>
apt-get install libopenssl-ruby
@</pre>
** No such file or directory -- enclient.rb (LoadError)

When multiple version of ruby are installed in the OS, the evernote-mode may use another ruby that has installed the evernote-mode (The ruby that has executed 'ruby setup.rb').
Specify the full path of ruby to the evernote-ruby-command, before load the evernote-mode.

e.g.
    @<pre>
    (setq evernote-ruby-command "/your/path/to/ruby")
    (require 'evernote-mode)
    @</pre>
