.emacs.d/vendor/evernote-mode/doc/readme_en.html

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><a name="Troubleshooting" id="Troubleshooting"></a><span class="section-number-2">9</span> Troubleshooting </h2>
<div class="outline-text-2" id="text-9">



</div>

<div id="outline-container-9.1" class="outline-3">
<h3 id="sec-9.1"><span class="section-number-3">9.1</span> `require': no such file to load &ndash; gdbm </h3>
<div class="outline-text-3" id="text-9.1">


<p>
Some distributions do not have the GDBM library for ruby. Install libgdbm-ruby for using GDBM.
</p>
<ul>
<li>
ex. for apt,

</li>
</ul>

<p><pre>
apt-get install libgdbm-ruby
</pre>
</p>
<ul>
<li>
In the case of ActiveScriptRuby or Ruby-mswin32

</li>
</ul>

<p>Retrieve gdbm.dll from <a href="http://jarp.does.notwork.org/win32/">Porting Libraries to Win32</a>, then copy it to the folder where ruby.exe exists.
</p>
<ul>
<li>
In the case of Mac OS X

</li>
</ul>

<p>The pre-installed ruby on Mac OS X does not contain GDBM bindings.
Re-install ruby and GDBM by <a href="http://www.macports.org/">MacPorts</a> or <a href="http://mxcl.github.com/homebrew/">Homebrew</a>.
</p>
<p>
MacPorts:
<pre>
$ sudo ports install ruby gdbm
</pre>
</p>
<p>
Homebrew:
<pre>
$ sudo brew install ruby gdbm
</pre>
</p>
<p>
Also, <a href="#sec-9.3">specify evernote-ruby-command</a>.
</p>
</div>

</div>

<div id="outline-container-9.2" class="outline-3">
<h3 id="sec-9.2"><span class="section-number-3">9.2</span> `require': no such file to load &ndash; net/https </h3>
<div class="outline-text-3" id="text-9.2">


<p>
Some distributions do not have the openssl library for ruby. Install libopenssl-ruby for using https.
</p>
<ul>
<li>
ex. for apt,

</li>
</ul>

<p><pre>
apt-get install libopenssl-ruby
</pre>
</p></div>

</div>

<div id="outline-container-9.3" class="outline-3">
<h3 id="sec-9.3"><span class="section-number-3">9.3</span> No such file or directory &ndash; enclient.rb (LoadError) </h3>
<div class="outline-text-3" id="text-9.3">


<p>
When multiple version of ruby are installed in the OS, the evernote-mode may use another ruby that has installed the evernote-mode (The ruby that has executed 'ruby setup.rb').
Specify the full path of ruby to the evernote-ruby-command, before load the evernote-mode.
</p>
<p>
e.g.
<pre>
(setq evernote-ruby-command "/your/path/to/ruby")
(require 'evernote-mode)
</pre>
</p></div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Yusuke Kawakami
<a href="mailto:Yusuke Kawakami">&lt;Yusuke Kawakami&gt;</a>
</p>
<p class="date"> Date: 2011-06-24 06:49:56 JST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
